zigbee-luo/zstack_sdk_2021/source/ti/ti154stack/low_level/cc26xx/ROM_Patch/FPB.c
/*******************************************************************************
  Filename:       FPB.c
  Revised:        $Date: 2013-08-02 09:58:22 -0700 (Fri, 02 Aug 2013) $
  Revision:       $Revision: 34867 $

  Description:    Flash Patch and Breakpoint.

  Copyright 2009-2013 Texas Instruments Incorporated. All rights reserved.

  IMPORTANT: Your use of this Software is limited to those specific rights
  granted under the terms of a software license agreement between the user
  who downloaded the software, his/her employer (which must be your employer)
  and Texas Instruments Incorporated (the "License").  You may not use this
  Software unless you agree to abide by the terms of the License. The License
  limits your use, and you acknowledge, that the Software may not be modified,
  copied or distributed unless embedded on a Texas Instruments microcontroller
  or used solely and exclusively in conjunction with a Texas Instruments radio
  frequency transceiver, which is integrated into your product.  Other than for
  the foregoing purpose, you may not use, reproduce, copy, prepare derivative
  works of, modify, distribute, perform, display or sell this Software and/or
  its documentation for any purpose.

  YOU FURTHER ACKNOWLEDGE AND AGREE THAT THE SOFTWARE AND DOCUMENTATION ARE
  PROVIDED “AS IS” WITHOUT WARRANTY OF ANY KIND, EITHER EXPRESS OR IMPLIED,
  INCLUDING WITHOUT LIMITATION, ANY WARRANTY OF MERCHANTABILITY, TITLE,
  NON-INFRINGEMENT AND FITNESS FOR A PARTICULAR PURPOSE. IN NO EVENT SHALL
  TEXAS INSTRUMENTS OR ITS LICENSORS BE LIABLE OR OBLIGATED UNDER CONTRACT,
  NEGLIGENCE, STRICT LIABILITY, CONTRIBUTION, BREACH OF WARRANTY, OR OTHER
  LEGAL EQUITABLE THEORY ANY DIRECT OR INDIRECT DAMAGES OR EXPENSES
  INCLUDING BUT NOT LIMITED TO ANY INCIDENTAL, SPECIAL, INDIRECT, PUNITIVE
  OR CONSEQUENTIAL DAMAGES, LOST PROFITS OR LOST DATA, COST OF PROCUREMENT
  OF SUBSTITUTE GOODS, TECHNOLOGY, SERVICES, OR ANY CLAIMS BY THIRD PARTIES
  (INCLUDING BUT NOT LIMITED TO ANY DEFENSE THEREOF), OR OTHER SIMILAR COSTS.

  Should you have any questions regarding your right to use this Software,
  contact Texas Instruments Incorporated at www.TI.com.
*******************************************************************************/

/*******************************************************************************
 * INCLUDES
 */

#include "comdef.h"
#include "hw_types.h"
#include "hw_memmap.h"
#include "gpio.h"

/*******************************************************************************
 * EXTERNS
 */

// address of flash jump table based defined in linker configuration table
// Note: This symbol is treated as a variable by the compiler.
extern uint32 FLASH_JT_ADDR;

// Patch Function Externs
// Add external patch functions here and in FPB_AddrTable below.
extern uint8 macCheckPendAddr_PATCH(uint8 pendAddrSpec, uint8 *pAddrList);

/*******************************************************************************
 * PROTOTYPES
 */

#if defined( PATCHED_CODE_WORD_ALIGNED )
void FPB_Relay0( void );
void FPB_Relay1( void );
void FPB_Relay2( void );
void FPB_Relay3( void );
void FPB_Relay4( void );
void FPB_Relay5( void );
void FPB_Relay6( void );
void FPB_Relay7( void );
#endif // PATCHED_CODE_WORD_ALIGNED

/*******************************************************************************
 * MACROS
 */

#define FPB_REMAP_OPCODE_UPPER(index)  *((uint16 *)((uint32)&FPB_OpcodeTable + ((index)*4)))
#define FPB_REMAP_OPCODE_LOWER(index)  *((uint16 *)((uint32)&FPB_OpcodeTable + ((index)*4) + 2))

#define FP_COMPx_REG(index)            HWREG(FPB_BASE + 0x08 + ((index)*4))

/*******************************************************************************
 * CONSTANTS
 */

#define FPB_BASE                       0xE0002000

// Flash Patch and Breakpoint (FPB) Registers
#define FP_CTRL_REG                    HWREG(FPB_BASE + 0x00)
#define FP_REMAP_REG                   HWREG(FPB_BASE + 0x04)
#define FP_COMP0_REG                   HWREG(FPB_BASE + 0x08)
#define FP_COMP1_REG                   HWREG(FPB_BASE + 0x0C)
#define FP_COMP2_REG                   HWREG(FPB_BASE + 0x10)
#define FP_COMP3_REG                   HWREG(FPB_BASE + 0x14)
#define FP_COMP4_REG                   HWREG(FPB_BASE + 0x18)
#define FP_COMP5_REG                   HWREG(FPB_BASE + 0x1C)
#define FP_COMP6_REG                   HWREG(FPB_BASE + 0x20)
#define FP_COMP7_REG                   HWREG(FPB_BASE + 0x24)

#define FPB_ENABLE                     0x00000001
#define FPB_KEY                        0x00000002
#define FPB_CTRL_INIT                  0x00000260

#define FPB_NUM_REMAP_REGS             6
#define FPB_NUM_LITERAL_REGS           2
#define FPB_NUM_COMPARE_ADDRS          (FPB_NUM_REMAP_REGS + FPB_NUM_LITERAL_REGS)

#define UNCOND_BRANCH_OPCODE           0xF400B800
#define IMM21_MASK                     0x001FFFFF
#define IMM10_MASK                     0x03FF0000
#define IMM11_MASK                     0x000007FF

#define BRANCH_TO_SELF_OPCODE          0xF7FFBFFE
#define NOP_OPCODE                     0xBF00
#define SVC_OPCODE(n)                  (0xDF00 | ((n) & 0xFF))

#define EXCSTK_R0                      0
#define EXCSTK_R1                      1
#define EXCSTK_R2                      2
#define EXCSTK_R3                      3
#define EXCSTK_R12                     4
#define EXCSTK_LR                      5
#define EXCSTK_RETURN                  6
#define EXCSTK_XPSR                    7

// Hardcoded address of functions to be patched in ROM as of the April 25, 2013 code freeze.
// Note:  To obtain this address, look in the timac_rom.map file and
//        search for the function's name.
// Note:  Should the ROM be altered and this patch is still in use, the new address
//        for this function must be looked up.
// address of function macCheckPendAddr()
#define MAC_CHECK_PEND_ADDR_ADDRRESS   0x10013c2b // This is the current addr in code freeze.


/*******************************************************************************
 * TYPEDEFS
 */

