zigbee-luo/zstack_sdk_2021/source/ti/ti154stack/low_level/cc26xx/ROM_Patch/FPB.c
// user defined sections for RAM, ROM, and Flash tables, functions, and pointers
#pragma section = "FPB_RAM_OPCODE_TBL"
#pragma section = "FPB_ROM_RELAY"
#pragma section = "FPB_ROM_RELAY_TBL"
#pragma section = "FPB_FLS_ADDR_TBL"
#pragma section = "FPB_FLS_ADDR_TBL_PTR"

// Note: For now, all FPB patches will be on function boundary addresses!
// TODO: NEED TO ALLOW EITHER TWO FUNCTIONS FOR CODE ADDRESS COMPARES, OR A
//       DATA ADDRESS AND DATA FOR LITERAL COMPARATOR MATCHES.
typedef void (*funcPtr_t)(void);
typedef struct
{
  funcPtr_t pFunc;      // function that is being patched
  funcPtr_t pFuncPatch; // patch function
} FPB_AddrTable_t;


/*******************************************************************************
 * LOCAL VARIABLES
 */


/*******************************************************************************
 * GLOBAL VARIABLES
 */

//
// FPB Flash Address Table
//
// This is the Flash Patch and Breakpoint (FPB) address table located in Flash.
// There is an entry for each compare, and each entry contains two function
// addresses: the first is the address of the function to patch, and the second
// is the address of the patch function. If the first function is NULL, the
// entry is skipped.
//
// Note: The last two entries in the table are for literal address compares. In
//       this case, the first entry is the address of the data read, and the
//       second entry is the data to replace the patched read. Currently, this
//       code doesn't support this. This address table would need to be updated
//       to support just data addresses, or symbols that resolve to data
//       addresses.
//
// Note: The FPB is also used for setting hardware breakpoints. It is possible
//       to use the FPB for breakpoints and patching as long is care is taken
//       not to collide with the debugger. It is therefore recommended that the
//       FPB Address Table be filled from the bottom up as the IAR debugger
//       appears to use the comparators from the top down (i.e. beginning at
//       comparator zero).
//
#pragma data_alignment=4
const FPB_AddrTable_t FPB_AddrTable[] @ "FPB_FLS_ADDR_TBL" =
  {
    {NULL, NULL},
    {NULL, NULL},
    {NULL, NULL},
    {NULL, NULL},
    {NULL, NULL},
    {(funcPtr_t)MAC_CHECK_PEND_ADDR_ADDRRESS, (funcPtr_t)&macCheckPendAddr_PATCH},
    {NULL, NULL},  // literal
    {NULL, NULL}   // literal
  };

#pragma data_alignment=4
const uint32 FPB_AddrTablePtr @ "FPB_FLS_ADDR_TBL_PTR" = (uint32)FPB_AddrTable;


//
// FPB ROM Relay Table
//
// This is the Flash Patch and Breakpoint (FPB) relay table located in ROM.
// There is one relay routine for each compare. The relay routines are used to
// transfer control from the ROM region to another memory region (usually Flash)
// to execute the patch routine. The relay routines get control when the opcode
// table uses PC relative branch opcodes, which are only supported when all
// patch functions are guaranteed to be word aligned.
//
#if defined( PATCHED_CODE_WORD_ALIGNED )
#pragma data_alignment=4
const funcPtr_t FPB_RelayTable[] @ "FPB_ROM_RELAY_TBL" =
  {
    FPB_Relay0,
    FPB_Relay1,
    FPB_Relay2,
    FPB_Relay3,
    FPB_Relay4,
    FPB_Relay5
  };
#endif // PATCHED_CODE_WORD_ALIGNED


//
// FPB RAM Opcode Table
//
// This is the Flash Patch and Breakpoint (FPB) opcode table located in RAM.
// Each 32 bit location contains either a single 32-bit Thumb-2 opcode, or a
// pair of Thumb/Thumb-2 opcodes for each of the available address comparators.
//
// Note: It is extremely important that this table be aligned on a memory
//       address boundary that corresponds to the number of comparators. As
//       the FPB has six address and two literal comparators, this table must
//       be located on a 32 byte boundary.
//
// Note: It is extremely important to understand that the opcode will execute
//       relative to the comparator address, not this table's address.
//
// Note: If you wish to view the Opcode table as disassembly, you'll need to
//       comment out this declaration, and replace with a function of the
//       same name with inline assembly of equivalent size.
//
#pragma data_alignment=4
uint32 FPB_OpcodeTable[ FPB_NUM_COMPARE_ADDRS ] @ "FPB_RAM_OPCODE_TBL";


/*******************************************************************************
 * @fn          FPB Initialization
 *
 * @brief       This routine sets up the Flash Patch and Breakpoint (FPB)
 *              hardware registers and the FPB Opcode Table located in RAM.
 *              The remap register holds the RAM location of patch opcodes.
 *              The comparator registers contain the address of the code that
 *              is to be patched. The control register enables FPB.
 *
 *              One of two possible solutions are provided. The first uses
 *              a PC relative branch while the second uses a Supervision Call.
 *              The PC relative branch opcodes stored in RAM must be built
 *              based on the address of the patch routine and the location of
 *              the FPB Compare Relay function. The addresses of the routine
 *              to be patched, and the patch routine, are located in the FPB
 *              Address Table. Please note that this approach will only work if
 *              the address of any patched routine is always on a word boundary.
 *              This is due to an ARM hardware limitation of the Comparator
 *              register. The second approach must build the opcodes in RAM
 *              based on whether the patch address is on a halfword or word
 *              boundary (and thus, supports both). A Supervison call is then
 *              used to determine the correct comparator, and to transfer
 *              control to the correct patch routine.
 *
 * input parameters
 *
 * @param       None.
 *
 * output parameters
 *
 * @param       None.
 *
 * @return      None.
 */
void FPB_Init( void )
{
  uint8  i;
#if defined( PATCHED_CODE_WORD_ALIGNED )
  int32  delta;
  uint32 opcode;
#endif // PATCHED_CODE_WORD_ALIGNED

  // set the re-map address in the FPB block
  FP_REMAP_REG = (uint32)&FPB_OpcodeTable;

  // disable flash patch
  FP_CTRL_REG = (FPB_CTRL_INIT | FPB_KEY) & ~FPB_ENABLE;

#if defined( PATCHED_CODE_WORD_ALIGNED )
  // build opcodes for patch routines
  for (i=0; i<FPB_NUM_REMAP_REGS; i++)
  {
    if ( FPB_AddrTable[i].pFunc != NULL )
    {
      // find the delta for the branch
      delta = (int32)( (uint32)FPB_RelayTable[i] -
                       (uint32)FPB_AddrTable[i].pFunc );

      // adjust for post PC operation
      // Note: The branch is relative to the PC address after the opcode.
      delta = ((delta - 4) / 2) & IMM21_MASK;

      // create unconditional branch opcode with correct immediate values
      // Note: For additional details on opcode encoding, please see the
      //       ARMv7-M Architecture Reference Manual.
      // Note: The values of J1 and J2 should be set to !(S ^ I1) and !(S ^ I2),
      //       but since our delta is always negative, and never beyond our
      //       relatively small ROM, the values of J1/J2 are always the same
      //       as I1/I2, i.e. 1.
      opcode = UNCOND_BRANCH_OPCODE        |
               ((delta << 5) & IMM10_MASK) |
               (delta & IMM11_MASK);

