zigbee-luo/zstack_sdk_2021/source/ti/ti154stack/low_level/cc26xx/ROM_Patch/FPB.c
      // store opcode in FPB RAM jump table
      // Note: The ARM Cortex M3 is a Thumb-2 architecture, which means it
      //       always fetches 16-bit instructions. If the instruction is a
      //       32-bit Thumb instruction, then it will fetch an additional
      //       16-bit halfword to complete the opcode. As such, the most
      //       significant halfword of the 32-bit Thumb instruction must be
      //       placed in the first halfword. If stored as a 32-bit word, then
      //       the halfwords would have to first be swapped to ensure the
      //       most significant halfword is fetched first in little endian
      //       order.
      FPB_REMAP_OPCODE_UPPER(i) = (uint16)(opcode >> 16);
      FPB_REMAP_OPCODE_LOWER(i) = (uint16)(opcode & 0xFFFF);

      // update FPB Comparator register with the address of the patched function
      FP_COMPx_REG(i) = (uint32)FPB_AddrTable[i].pFunc | FPB_ENABLE;
    }
    else // nothing asssigned for this comparator
    {
      // so put a spinlock instruction to trap the system as this is an error
      FPB_REMAP_OPCODE_UPPER(i) = (uint16)(BRANCH_TO_SELF_OPCODE >> 16);
      FPB_REMAP_OPCODE_LOWER(i) = (uint16)(BRANCH_TO_SELF_OPCODE & 0xFFFF);
    }
  }

#else // !PATCHED_CODE_WORD_ALIGNED

  // build opcodes for patch routines
  for (i=0; i<FPB_NUM_REMAP_REGS; i++)
  {
    if ( FPB_AddrTable[i].pFunc != NULL )
    {
      // check if the address of the patch routine is on a halfword
      if ( (uint32)FPB_AddrTable[i].pFunc & 0x2 )
      {
        // yes, so read the last opcode of the previous routine and use that
        // as the first spoofed opcode
        FPB_REMAP_OPCODE_UPPER(i) = *((uint16 *)((uint32)FPB_AddrTable[i].pFunc & ~0x3));

        // and set the SVC opcode as the second spoofed opcode
        FPB_REMAP_OPCODE_LOWER(i) = SVC_OPCODE(i);
      }
      else // patched routine is on a word boundary
      {
        // so set the SVC opcde first
        FPB_REMAP_OPCODE_UPPER(i) = SVC_OPCODE(i);

        // followed by NOP
        FPB_REMAP_OPCODE_LOWER(i) = NOP_OPCODE;
      }

      // update FPB Comparator register with the address of the patched function
      FP_COMPx_REG(i) = (uint32)FPB_AddrTable[i].pFunc | FPB_ENABLE;
    }
    else // nothing assigned for this comparator
    {
      // so put a spinlock instruction to trap the system as this is an error
      FPB_REMAP_OPCODE_UPPER(i) = (uint16)(BRANCH_TO_SELF_OPCODE >> 16);
      FPB_REMAP_OPCODE_LOWER(i) = (uint16)(BRANCH_TO_SELF_OPCODE & 0xFFFF);
    }
  }
#endif // PATCHED_CODE_WORD_ALIGNED

  // enable flash patch hardware
  FP_CTRL_REG = FPB_CTRL_INIT | FPB_KEY | FPB_ENABLE;

  return;
}


#if !defined( PATCHED_CODE_WORD_ALIGNED )
/*******************************************************************************
 * @fn          FPB_ProcessSVC
 *
 * @brief       This routine is the SVC handler for processing Flash Patch
 *              and Breakpoint (FPB) remaps. It is called from the SVC_ISR.
 *              It first determines if an SVC in code executed, or if the SVC
 *              instruction was spoofed by FPB. In the former case, the SVC
 *              number is obtained from the opcode, and is returned. In the
 *              latter case, the correct patch routine is determined based on
 *              the SVC Exception stack Return Address. If located, the
 *              Return Address on the stack is updated with the patch routine,
 *              otherwise the Return Address is set to the address of the
 *              routine that called the routine to be patched and an SVC
 *              number of zero is returned.
 *
 *              Note:
 *              SP[0] = R0
 *              SP[1] = R1
 *              SP[2] = R2:
 *              SP[3] = R3:
 *              SP[4] = R12:
 *              SP[5] = LR: Return address to the function that called the
 *                          function that got patched.
 *              SP[6] = SVC return address.
 *
 * input parameters
 *
 * @param       stackPointer - The SVC stack pointer.
 *
 * output parameters
 *
 * @param       None.
 *
 * @return      SVC Number 0-255, where 0-7 are reserved for FPB.
 */
uint8 FPB_ProcessSVC( uint32 *stackPointer )
{
  uint8  i;
  uint32 patchedFunc;
  uint16 patchedOpcode;

  // get the patched function address
  // Note: The SVC is a Thumb instruction, so the SVCall Exception stack
  //       Return Address contains the next address on a even address boundary.
  //       We only need subtract one to get the address of the patched routine.
  patchedFunc = (stackPointer[EXCSTK_RETURN] - 1);

  // get the first Thumb opcode at the patched function address
  // Note: Since the Thumb address always sets bit 0 to one, subtract one to
  //       get the correct memory address.
  patchedOpcode = *(uint16 *)(patchedFunc-1);

  // check if the SVC was directly called or was spoofed by FPB
  if ( (patchedOpcode & 0xFF00) == SVC_OPCODE(0) )
  {
    // we have a real SVC in code, so not an FPB operation; get the SVC number
    return( (uint8)(patchedOpcode & 0x00FF) );
  }
  else // SVC was spoofed by FPB
  {
    // search patch table for function address match
    for (i=0; i<FPB_NUM_REMAP_REGS; i++)
    {
      // check for a patched function address match
      if ( patchedFunc == (uint32)FPB_AddrTable[i].pFunc )
      {
        // found, so set Return Address to the address of the patched routine
        // Note: The Return Address always has bit 0 set to zero.
        stackPointer[EXCSTK_RETURN] = (uint32)(FPB_AddrTable[i].pFuncPatch)-1;

        // return implied SVC number based on the FPB comparator used
        return( i );
      }
    }

    // no match found, so set return address to the address that called the
    // patch routine, rendering the SVCall Handler moot
    stackPointer[EXCSTK_RETURN] = stackPointer[EXCSTK_LR];

    // indicate invalid SVC number
    // Note: As FPB handling doesn't use the SVC number directly, it isn't a
    //       problem to return value even though no corresponding patch routine
    //       was found.
    return( 0 );
  }
}
#endif // !PATCHED_CODE_WORD_ALIGNED


#if defined( PATCHED_CODE_WORD_ALIGNED )
/*******************************************************************************
 * @fn          FPB Relay 0
 *
 * @brief       This routine is the Flash Patch and Breakpoint (FPB) relay. It
 *              is located in ROM, and is called by the opcode located in the
 *              FPB Opcode Table when a patched address in ROM matches the
 *              address stored in the FPB Comparator register in hardware. Its
 *              purpose is to save the Patch Address Table offset and transfer
 *              control to a common handler.
 *
 *              Note: While R0-R3 and R12 are specified by ARM as scratch
 *                    registers, R0-R3 can also be used for passing parameters,
 *                    and thus may be in use. Thus, at this point, only R12 is
 *                    available.
 *
 * input parameters
 *
 * @param       None.
 *
 * output parameters
 *
 * @param       None.
 *
 * @return      None.
 */
void FPB_Relay0( void ) @ "FPB_ROM_RELAY"
{
  // save the patch address table offset
  // Note: The Patch Address Table contains the address of the routine to be
  //       patched and the address of the patch routine; thus, eight bytes per
  //       comparator. As the address of the patch routine is what's required,
  //       the table offset is: (N * 8) + 4.
  asm("MOV R12, #(0*8)+4");

  // and go to common handler
  asm("B FPB_RelayCommon");
}


