zigbee-luo/zstack_sdk_2021/source/ti/ti154stack/low_level/cc26xx/ROM_Patch/FPB.c
/*******************************************************************************
 * @fn          FPB Relay 1
 *
 * @brief       This routine is the Flash Patch and Breakpoint (FPB) relay. It
 *              is located in ROM, and is called by the opcode located in the
 *              FPB Opcode Table when a patched address in ROM matches the
 *              address stored in the FPB Comparator register in hardware. Its
 *              purpose is to save the Patch Address Table offset and transfer
 *              control to a common handler.
 *
 *              Note: While R0-R3 and R12 are specified by ARM as scratch
 *                    registers, R0-R3 can also be used for passing parameters,
 *                    and thus may be in use. Thus, at this point, only R12 is
 *                    available.
 *
 * input parameters
 *
 * @param       None.
 *
 * output parameters
 *
 * @param       None.
 *
 * @return      None.
 */
void FPB_Relay1( void ) @ "FPB_ROM_RELAY"
{
  // save the patch address table offset
  // Note: The Patch Address Table contains the address of the routine to be
  //       patched and the address of the patch routine; thus, eight bytes per
  //       comparator. As the address of the patch routine is what's required,
  //       the table offset is: (N * 8) + 4.
  asm("MOV R12, #(1*8)+4");

  // and go to common handler
  asm("B FPB_RelayCommon");
}


/*******************************************************************************
 * @fn          FPB Relay 2
 *
 * @brief       This routine is the Flash Patch and Breakpoint (FPB) relay. It
 *              is located in ROM, and is called by the opcode located in the
 *              FPB Opcode Table when a patched address in ROM matches the
 *              address stored in the FPB Comparator register in hardware. Its
 *              purpose is to save the Patch Address Table offset and transfer
 *              control to a common handler.
 *
 *              Note: While R0-R3 and R12 are specified by ARM as scratch
 *                    registers, R0-R3 can also be used for passing parameters,
 *                    and thus may be in use. Thus, at this point, only R12 is
 *                    available.
 *
 * input parameters
 *
 * @param       None.
 *
 * output parameters
 *
 * @param       None.
 *
 * @return      None.
 */
void FPB_Relay2( void ) @ "FPB_ROM_RELAY"
{
  // save the patch address table offset
  // Note: The Patch Address Table contains the address of the routine to be
  //       patched and the address of the patch routine; thus, eight bytes per
  //       comparator. As the address of the patch routine is what's required,
  //       the table offset is: (N * 8) + 4.
  asm("MOV R12, #(2*8)+4");

  // and go to common handler
  asm("B FPB_RelayCommon");
}


/*******************************************************************************
 * @fn          FPB Relay 3
 *
 * @brief       This routine is the Flash Patch and Breakpoint (FPB) relay. It
 *              is located in ROM, and is called by the opcode located in the
 *              FPB Opcode Table when a patched address in ROM matches the
 *              address stored in the FPB Comparator register in hardware. Its
 *              purpose is to save the Patch Address Table offset and transfer
 *              control to a common handler.
 *
 *              Note: While R0-R3 and R12 are specified by ARM as scratch
 *                    registers, R0-R3 can also be used for passing parameters,
 *                    and thus may be in use. Thus, at this point, only R12 is
 *                    available.
 *
 * input parameters
 *
 * @param       None.
 *
 * output parameters
 *
 * @param       None.
 *
 * @return      None.
 */
void FPB_Relay3( void ) @ "FPB_ROM_RELAY"
{
  // save the patch address table offset
  // Note: The Patch Address Table contains the address of the routine to be
  //       patched and the address of the patch routine; thus, eight bytes per
  //       comparator. As the address of the patch routine is what's required,
  //       the table offset is: (N * 8) + 4.
  asm("MOV R12, #(3*8)+4");

  // and go to common handler
  asm("B FPB_RelayCommon");
}


/*******************************************************************************
 * @fn          FPB Relay 4
 *
 * @brief       This routine is the Flash Patch and Breakpoint (FPB) relay. It
 *              is located in ROM, and is called by the opcode located in the
 *              FPB Opcode Table when a patched address in ROM matches the
 *              address stored in the FPB Comparator register in hardware. Its
 *              purpose is to save the Patch Address Table offset and transfer
 *              control to a common handler.
 *
 *              Note: While R0-R3 and R12 are specified by ARM as scratch
 *                    registers, R0-R3 can also be used for passing parameters,
 *                    and thus may be in use. Thus, at this point, only R12 is
 *                    available.
 *
 * input parameters
 *
 * @param       None.
 *
 * output parameters
 *
 * @param       None.
 *
 * @return      None.
 */
void FPB_Relay4( void ) @ "FPB_ROM_RELAY"
{
  // save the patch address table offset
  // Note: The Patch Address Table contains the address of the routine to be
  //       patched and the address of the patch routine; thus, eight bytes per
  //       comparator. As the address of the patch routine is what's required,
  //       the table offset is: (N * 8) + 4.
  asm("MOV R12, #(4*8)+4");

  // and go to common handler
  asm("B FPB_RelayCommon");
}


/*******************************************************************************
 * @fn          FPB Relay 5
 *
 * @brief       This routine is the Flash Patch and Breakpoint (FPB) relay. It
 *              is located in ROM, and is called by the opcode located in the
 *              FPB Opcode Table when a patched address in ROM matches the
 *              address stored in the FPB Comparator register in hardware. Its
 *              purpose is to save the Patch Address Table offset and transfer
 *              control to a common handler.
 *
 *              Note: While R0-R3 and R12 are specified by ARM as scratch
 *                    registers, R0-R3 can also be used for passing parameters,
 *                    and thus may be in use. Thus, at this point, only R12 is
 *                    available.
 *
 * input parameters
 *
 * @param       None.
 *
 * output parameters
 *
 * @param       None.
 *
 * @return      None.
 */
void FPB_Relay5( void ) @ "FPB_ROM_RELAY"
{
  // save the patch address table offset
  // Note: The Patch Address Table contains the address of the routine to be
  //       patched and the address of the patch routine; thus, eight bytes per
  //       comparator. As the address of the patch routine is what's required,
  //       the table offset is: (N * 8) + 4.
  asm("MOV R12, #(5*8)+4");

  // and go to common handler
  asm("B FPB_RelayCommon");
}


