zigbee-luo/zstack_sdk_2021/source/ti/ti154stack/low_level/cc26xx/ROM_Patch/FPB.c
/*******************************************************************************
 * @fn          FPB Relay Common
 *
 * @brief       This routine is the common Flash Patch and Breakpoint (FPB)
 *              relay. It is located in ROM, and is called by one of the FPB
 *              Relay functions (FPB Relay 0 to FPB Relay 7). Its purpose is
 *              to provide a common routine to complete the transfer of control
 *              from the ROM memory region to the patched function in the
 *              Flash or RAM memory region. Other than the transfer, this
 *              routine will appear transparent in the patch process, and
 *              the patched routine's return through LR will pass control
 *              directly to the function that called the patch function.
 *
 *              Note: This solution was originally developed using the
 *                    Monolithic Build method where the addresses of the
 *                    Relay Table and the relay functions are resolved at the
 *                    same time as the Flash Address Table. However, with the
 *                    Multiple Build method, the ROM build would not have the
 *                    Flash Address Table address resolved. This can be solved
 *                    by adding the address of the Flash Address Table to the
 *                    Flash Jump Table. Alternatively, the location of the
 *                    Flash Address Table can be directly conveyed by a linker
 *                    symbol. In either case, this file would have to be
 *                    included in the ROM build and conditional compiling would
 *                    be needed to exclude flash related software in the ROM
 *                    build and ROM related software in the flash build. For
 *                    now, this was not done, so this approach is not supported
 *                    by the Multiple Build method.
 *
 * input parameters
 *
 * @param       None.
 *
 * output parameters
 *
 * @param       None.
 *
 * @return      None.
 */
void FPB_RelayCommon( void ) @ "FPB_ROM_RELAY"
{
  // preserve needed registers
  asm("PUSH {R0, R1}");

  // move patch address table offset to spare register
  asm("MOV R1, R12");

  // load the address of the Flash Address Table
  asm("LDR.W R0, FPB_AddrTablePtr");

  // load the address of the patch function based on the offset
  asm("LDR R12, [R0, R1]");

  // restore preserved registers
  asm("POP {R0, R1}");

  // branch unconditionally to the patch routine
  // Note: The patch routine's normal return through LR will return control
  //       directly to the routine that called the patched routine.
  asm("BX R12");
}
#endif // PATCHED_CODE_WORD_ALIGNED


/*******************************************************************************
 */

